zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_OFF (24u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_OFF (26u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_OFF (28u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_OFF (30u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_OFF (0u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_OFF (1u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_OFF (2u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_OFF (3u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_OFF (4u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_OFF (31u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_OFF (1u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_OFF (2u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_OFF (3u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_OFF (4u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_OFF (5u)

/** \brief Length for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_OFF (6u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CSQER */
#define IFX_DMU_HF_CLRE_CSQER_OFF (1u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CPROER */
#define IFX_DMU_HF_CLRE_CPROER_OFF (2u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CPVER */
#define IFX_DMU_HF_CLRE_CPVER_OFF (3u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CEVER */
#define IFX_DMU_HF_CLRE_CEVER_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CLRE_Bits.CADER */
#define IFX_DMU_HF_CLRE_CADER_OFF (5u)

