zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_OFF (29u)

