zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_OFF (9u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_LEN (2u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_OFF (11u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_OFF (13u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_LEN (6u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_LEN (6u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_OFF (8u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_LEN (6u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_OFF (16u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_LEN (6u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_OFF (24u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM1X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM1X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM1X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM1X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM1X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM1X_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM2X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM2X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM2X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM2X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM2X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM2X_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM3X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM3X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM3X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM3X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM3X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM3X_OFF (3u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM4X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM4X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM4X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM4X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM4X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM4X_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM5X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM5X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM5X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM5X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM5X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM5X_OFF (5u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM6X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM6X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM6X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM6X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM6X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM6X_OFF (6u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM7X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM7X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM7X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM7X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM7X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM7X_OFF (7u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM8X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM8X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM8X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM8X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM8X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM8X_OFF (8u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM9X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM9X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM9X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM9X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM9X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM9X_OFF (9u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_OFF (10u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_OFF (11u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_OFF (12u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_OFF (13u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_OFF (14u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_OFF (15u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM16X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM16X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM16X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM16X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM16X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM16X_OFF (16u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM17X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM17X_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM17X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM17X_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM17X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM17X_OFF (17u)

